package com.ourgame.mahjong.bloodriver.state
{
	import com.wecoit.debug.Log;
	import com.wecoit.mvc.State;
	
	/**
	 * 游戏状态
	 * @author SiaoLeon
	 */
	public class GameState extends State
	{
		// -------------------------------------------------------------------------------------------------------- 静态常量
		
		// -------------------------------------------------------------------------------------------------------- 静态变量
		
		// -------------------------------------------------------------------------------------------------------- 静态方法
		
		// -------------------------------------------------------------------------------------------------------- 静态函数
		
		// -------------------------------------------------------------------------------------------------------- 属性
		
		// -------------------------------------------------------------------------------------------------------- 变量
		
		// -------------------------------------------------------------------------------------------------------- 构造
		
		/**
		 * 构造函数
		 */
		public function GameState(key:Object=null)
		{
			super(key);
			
			this.add(new ShuffleState()); //洗牌
			this.add(new DealDiceState()); //发牌骰子
			this.add(new DealCardsState()); //发牌
			this.add(new ChangeDiceState()); //换牌骰子
			this.add(new ChangeCardsState()); //换牌
			this.add(new PlayState()); //行牌
			this.add(new ResultState()); //结算
		}
		
		// -------------------------------------------------------------------------------------------------------- 方法
		
		override public function onEnter():void
		{
			Log.debug("进入", this.key);
		}
		
		override public function onExit():void
		{
			Log.debug("离开", this.key);
		}
	
		// -------------------------------------------------------------------------------------------------------- 函数
	
	}
}
