package com.ourgame.mahjong.bloodriver.view
{
	import com.ourgame.mahjong.bloodriver.ui.GameScene;
	import com.ourgame.mahjong.bloodriver.ui.LayerManager;
	import com.wecoit.mvc.View;
	
	/**
	 * 游戏视图
	 * @author SiaoLeon
	 */
	public class GameView extends View
	{
		// -------------------------------------------------------------------------------------------------------- 静态常量
		
		// -------------------------------------------------------------------------------------------------------- 静态变量
		
		// -------------------------------------------------------------------------------------------------------- 静态方法
		
		// -------------------------------------------------------------------------------------------------------- 静态函数
		
		// -------------------------------------------------------------------------------------------------------- 属性
		
		public var scene:GameScene;
		
		// -------------------------------------------------------------------------------------------------------- 变量
		
		// -------------------------------------------------------------------------------------------------------- 构造
		
		/**
		 * 构造函数
		 */
		public function GameView()
		{
			super();
		}
		
		// -------------------------------------------------------------------------------------------------------- 方法
		
		override public function onAdd():void
		{
			this.scene = new GameScene();
			LayerManager.instance.foreground.addChild(this.scene);
		}
		
		override public function onRemove():void
		{
			LayerManager.instance.foreground.removeChild(this.scene);
			this.scene = null;
		}
	
		// -------------------------------------------------------------------------------------------------------- 函数
	
	}
}
