package com.ourgame.mahjong.bloodriver.lobby.state
{
	import com.ourgame.mahjong.bloodriver.lobby.controller.ConnectController;
	import com.ourgame.mahjong.bloodriver.lobby.controller.ConnectSocketController;
	import com.wecoit.debug.Log;
	import com.wecoit.mvc.State;
	
	/**
	 * 连接状态
	 * @author SiaoLeon
	 */
	public class ConnectState extends State
	{
		// -------------------------------------------------------------------------------------------------------- 静态常量
		
		// -------------------------------------------------------------------------------------------------------- 静态变量
		
		// -------------------------------------------------------------------------------------------------------- 静态方法
		
		// -------------------------------------------------------------------------------------------------------- 静态函数
		
		// -------------------------------------------------------------------------------------------------------- 属性
		
		// -------------------------------------------------------------------------------------------------------- 变量
		
		// -------------------------------------------------------------------------------------------------------- 构造
		
		/**
		 * 构造函数
		 */
		public function ConnectState(key:Object=null)
		{
			super(key);
		}
		
		// -------------------------------------------------------------------------------------------------------- 方法
		
		override public function onEnter():void
		{
			Log.debug("进入连接状态");
			
			this.addController(new ConnectSocketController());
			this.addController(new ConnectController());
		}
	
		// -------------------------------------------------------------------------------------------------------- 函数
	
	}
}
