package com.ourgame.mahjong.bloodriver.ui
{
	import com.ourgame.mahjong.bloodriver.enum.UITableDefinition;
	import com.wecoit.core.AssetsManager;
	
	import flash.display.MovieClip;
	import flash.display.Sprite;
	
	/**
	 * 胡牌番数数字
	 * @author SiaoLeon
	 */
	public class WinFanNumber extends Sprite
	{
		// -------------------------------------------------------------------------------------------------------- 静态常量
		
		// -------------------------------------------------------------------------------------------------------- 静态变量
		
		// -------------------------------------------------------------------------------------------------------- 静态方法
		
		// -------------------------------------------------------------------------------------------------------- 静态函数
		
		// -------------------------------------------------------------------------------------------------------- 属性
		
		// -------------------------------------------------------------------------------------------------------- 变量
		
		// -------------------------------------------------------------------------------------------------------- 构造
		
		/**
		 * 构造函数
		 */
		public function WinFanNumber(value:uint)
		{
			super();
			
			var string:String = value.toString();
			
			for (var i:int = 0; i < string.length; i++)
			{
				var count:uint = uint(string.charAt(i));
				var mc:MovieClip = AssetsManager.instance.getDefinitionMovieClip(UITableDefinition.WinFanNumber);
				mc.x = i * 28;
				mc.gotoAndStop(count + 1);
				this.addChild(mc);
			}
		}
	
		// -------------------------------------------------------------------------------------------------------- 方法
	
		// -------------------------------------------------------------------------------------------------------- 函数
	
	}
}
